# DB REDIS LOCK

IIIIIIIIIIIIIIIIIIIIIIIIIIIIIIII

IIIIIIIIIIIIIIIIIIIIIIIIIIIIIIII

## ðŸ“Œ Redis

- belirli aralÄ±klarla (isteÄŸe baÄŸlÄ± olarak) verileri dosyaya kaydedebilir.
- tÃ¼mÃ¼yle `C` ile yazÄ±lmÄ±ÅŸtÄ±r. tek thread Ã§alÄ±ÅŸÄ±r.

`Redis` client'larÄ±:

- __Lettuce__

  reactive API, `thread-safe`.

  Sadece native `Redis`'in sunduÄŸu Ã¶zellikleri full destekleyen API'ler sunar.

- __Redisson__

  `Redis` aslÄ±nda "lock" gibi Ã¶zellikleri native desteklemez. Fakat `redisson` bazÄ± tricky yÃ¶ntemlerle daha geliÅŸmiÅŸ Ã¶zelliklerin kullanÄ±lmasÄ±nÄ± saÄŸlar:

  `Queue`, `Scheduler`, `RPC`, `Lock`

- __Jedis__

  Ã§ok basit ve sadece sync API sunuyor.

- __Spring-data-Redis__

  wrapper'dÄ±r. arka planda `Jedis` yada farklÄ± bir implementasyonu kullanÄ±r.

  `Spring cache` modÃ¼lÃ¼ndeki `redis` provider'Ä±ndan tamamen farklÄ± bir pakettir.

Terimler hakkÄ±nda:

- `Redis Lab`; `Redis`'in enterprise versiyonunu geliÅŸtiren firmanÄ±n ismi.
- `Redis lab`'in kendi AWS'lerinde bize hazÄ±r sunduÄŸu `Redis`'ler var. bu hizmetin Ã¶zel adÄ± `Redis Enterprise Essentials` dÄ±r.
- `Redis Enterprise Pro` ise `Redis lab`'Ä±n sunduÄŸu AWS entegrasyonudur. Kendi AWS hesabÄ±mÄ±zda kullanacaÄŸÄ±mÄ±z `Redis`'lerdir.

## ðŸ“Œ Redis Sentinel

ayrÄ± bir instance'tÄ±r. client kÃ¼tÃ¼phanesinin sentinel desteÄŸi olmak zorundadÄ±r.

proxy gibi Ã§alÄ±ÅŸmaz. hangi `Redis` instance'larÄ± ayakta diye, sentinel sÃ¼rekli monitoring yapar ve bunu client'lara bildirir. client'lar, sentinel'e sadece hangi `Redis`'ler ayakta diye sorar.

## ðŸ“Œ data types of Redis

`Redis`'te her bilgi bir key'e karÅŸÄ±lÄ±k tutulur. Ã–rneÄŸin bir liste tutacak isek bunun bir key'i vardÄ±r. o key aracÄ±lÄ±ÄŸÄ± ile bu listeye eriÅŸebiliriz. 1 adet key bazen sadece 1 adet string tutmak iÃ§in kullanÄ±lÄ±r.

`Redis` aÅŸaÄŸÄ±daki tiplerden daha fazlasÄ±nÄ± destekler. AynÄ± zamanda aÅŸaÄŸÄ±daki tipler iÃ§erisinde data'yÄ± bit bazÄ±nda okuma gibi birÃ§ok ek Ã¶zellik sunar.

### ðŸ“ŒðŸ“Œ String

bir key karÅŸÄ±lÄ±ÄŸÄ±nda bir string saklar. Ã–rnek `Redis` komut satÄ±rÄ± ile bir key oluÅŸturabiliriz:

```text
> SET mykey "10"
```

var olan string'e append, eÄŸer sayÄ± ise 1 arttÄ±rma gibi Ã¶zel komutlarda sunar.

### ðŸ“ŒðŸ“Œ List

`Redis` komut satÄ±rlarÄ± Ã¶rnekler:

```text
> LPUSH mylist a   # now the list is "a"
> LPUSH mylist b   # now the list is "b","a" # append to left side - left push
> RPUSH mylist c   # now the list is "b","a","c" # append to right side - right push
```

### ðŸ“ŒðŸ“Œ Set

1 key'e karÅŸÄ±lÄ±k tÃ¼m set'i barÄ±ndÄ±rÄ±yoruz.

```text
> sadd myset 1 2 3
(integer) 3

> smembers myset
1. 3
2. 1
3. 2
```

### ðŸ“ŒðŸ“Œ Hashes

1 key'e karÅŸÄ±lÄ±k bir `hashmap` barÄ±ndÄ±rÄ±yoruz.

`Redis` 4 ile birlikte, `HMSET` komutu, `HSET` olarak deÄŸiÅŸtirildi.

```text
> HSET myhash field1 "Hello"
(integer) 1

> HGET myhash field1
"Hello"
```
